hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v2/TAL_AUSKUNFT_BESTANDSUEBERSICHT_01/QEB.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
    xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v2" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>NEU</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
            </order>
            <message>
                <QEB>
                    <meldungsattribute>
                        <externeAuftragsnummer>${externalOrderId}</externeAuftragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0000</meldungscode>
                            <meldungstext>keine Änderung zum Auftrag</meldungstext>
                            <positionsattribute>
                                <ansprechpartnerTelekom>
                                    <anrede>1</anrede>
                                    <vorname>Steve</vorname>
                                    <nachname>Vollmann</nachname>
                                    <telefonnummer>1682076651</telefonnummer>
                                    <emailadresse>sv@web.de</emailadresse>
                                </ansprechpartnerTelekom>
                            </positionsattribute>
                        </position>
                    </meldungspositionen>
                </QEB>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
